app/Models/Admin/KatFilm.php

SELECT `nama_kategori`
FROM `kategori`
---
    public function getKat(){
         return $this->db->table('kategori')->select('nama_kategori')->get()->getResultArray();